/**/
"Cancel" = "Cancel";
/**/
"Delete" = "Delete";
/**/
"Open" = "Open";
/**/
"Edit" = "Edit";
/**/
"Yes" = "Yes";
/**/
"Finish" = "Finish";
/**/
"Done" = "Done";
/**/
"Save" = "Save";
/**/
"Undo" = "Undo";
/**/
"Redo" = "Redo";
/**/
"OK" = "OK";
/**/
"Yes Delete" = "Yes Delete";


/*Geometry Edit Action Name*/
"Apply Geometry" = "Apply Geometry";
/*Geometry Edit Action Name*/
"Clear Geometry" = "Clear Geometry";
/*Geometry Edit Action Name*/
"Delete Vertex" = "Delete Vertex";
/*Geometry Edit Action Name*/
"Insert Part" = "Insert Part";
/*Geometry Edit Action Name*/
"Insert Vertex" = "Insert Vertex";
/*Geometry Edit Action Name*/
"Move Vertex" = "Move Vertex";
/*Geometry Edit Action Name*/
"Remove Part" = "Remove Part";

/*Collecting attachments*/
"Add" = "Add";
/*Collecting attachments*/
"Take Photo or Video" = "Take Photo or Video";
/*Collecting attachments*/
"Choose From Library" = "Choose From Library";
/*Collecting attachments*/
"Photo" = "Photo";
/*Collecting attachments*/
"Video" = "Video";
/*Collecting attachments*/
"Save To Photo Library" = "Save To Photo Library";
/*Collecting attachments*/
"Download" = "Download";

/*Date attribute*/
"Today" = "Today";

/**/
"Attachments" = "Attachments";
"Attributes" = "Attributes";

/**/
"Open in Safari" = "Open in Safari";

/* Please enter a numeric value between 0 and 5.*/
"Enter a number between %i and %i." = "Enter a number between %i and %i.";

/* Please enter a numeric value between 0.5 and 5.0.*/
"Enter a number between %@ and %@." = "Enter a number between %@ and %@.";

/* string length error, when user enters too many characters in string attribute editor:
  Too many characters.  Current: 512.  Allowed: 256 */
"Too many characters (%@)" = "Too many characters (%@)";

/* When a number is entered outside the range */
"Number is outside the acceptable range." = "Number is outside the acceptable range.";

/* BLOB, RASTER, etc */
"Field type not supported" = "Field type not supported";

/**/
"%d of %d" = "%d of %d";

/**/
"Changing Feature Type" = "Changing Feature Type";
"You are changing the feature type, which may potentially overwrite some field values. Are you sure you want to do this?" =  "You are changing the feature type, which may potentially overwrite some field values. Are you sure you want to do this?";

/**/
"Deleting Feature" = "Deleting Feature";
"Are you sure you want to delete this feature?" = "Are you sure you want to delete this feature?";

/**/
"Data for pie chart is invalid" = "Data for pie chart is invalid";
"No data to create a pie chart" = "No data to create a pie chart";
"No image to display" = "No image to display";

/**/
"Created by %@ seconds ago" = "Created by %@ seconds ago";

/**/
"Created by %@ a minute ago" = "Created by %@ a minute ago";

/**/
"Edited by %@ seconds ago" = "Edited by %@ seconds ago";

/**/
"Edited by %@ a minute ago" = "Edited by %@ a minute ago";

/**/
"Created seconds ago" = "Created seconds ago";

/**/
"Created a minute ago" = "Created a minute ago";

/**/
"Edited seconds ago" = "Edited seconds ago";

/**/
"Edited a minute ago" = "Edited a minute ago";

/**/
"Created by %@ %d minutes ago" = "Created by %@ %d minutes ago";

/**/
"Created by %@ an hour ago" = "Created by %@ an hour ago";

/**/
"Created by %@ %d hours ago" = "Created by %@ %d hours ago";

/*"Created by %@ on ${weekDay} at ${formattedTime}"*/
"Created by %@ on %@ at %@ - day" = "Created by %@ on %@ at %@";

/*"Created by %@ on ${formattedDate} at ${formattedTime}"*/
"Created by %@ on %@ at %@ - full" = "Created by %@ on %@ at %@";

/**/
"Edited by %@ %d minutes ago" = "Edited by %@ %d minutes ago";

/**/
"Edited by %@ an hour ago" = "Edited by %@ an hour ago";

/**/
"Edited by %@ %d hours ago" = "Edited by %@ %d hours ago";

/**/
"Edited by %@ on %@ at %@ - day" = "Edited by %@ on %@ at %@";

/**/
"Edited by %@ on %@ at %@ - full" = "Edited by %@ on %@ at %@";

/**/
"Created by %@" = "Created by %@";

/**/
"Edited by %@" = "Edited by %@";

/**/
"Created %d minutes ago" = "Created %d minutes ago";

/**/
"Created an hour ago" = "Created an hour ago";

/**/
"Created %d hours ago" = "Created %d hours ago";

/*"Created on ${weekDay} at ${formattedTime}"*/
"Created on %@ at %@ - day" = "Created on %@ at %@";

/*"Created on ${formattedDate} at ${formattedTime}"*/
"Created on %@ at %@ - full" = "Created on %@ at %@";

/**/
"Edited %d minutes ago" = "Edited %d minutes ago";

/**/
"Edited an hour ago" = "Edited an hour ago";

/**/
"Edited %d hours ago" = "Edited %d hours ago";

/*"Edited on ${weekDay} at ${formattedTime}"*/
"Edited on %@ at %@ - day" = "Edited on %@ at %@";

/*"Edited on ${formattedDate} at ${formattedTime}"*/
"Edited on %@ at %@ - full" = "Edited on %@ at %@";

/* Used to denote a required field */
"Required" = "Required";

/* Used for naming layers with no names */
"Layer %d" = "Layer %d";

/* Geocoding: returned when locator cannot find address for given location */
"Cannot find address for location" = "Cannot find address for location";

/* Geocoding: returned when locator cannot find location for given address */
"Cannot find location for address" = "Cannot find location for address";

/* Geocoding: core: used when address cannot be read */
"Cannot read address" = "Cannot read address";

/* Geocoding: core: used when one of the locator files cannot be found */
"File not found" = "File not found";

/* Geocoding: core: returned when locator cannot be loaded */
"Cannot load locator" = "Cannot load locator";

/* Geocoding: core: returned when some internal engine error occurs */
"Locator internal error" = "Locator internal error";

/* Geocoding: core: used when client tried to geocode intersections while locator does not support it */
"Intersections geocoding is not supported by locator" = "Intersections geocoding is not supported by locator";

/* Geocoding: core: returned when some locator property is not valid */
"Invalid locator properties" = "Invalid locator properties";

/* Geocoding: core: used when client did not set required field for address geocoding */
"Required field is missing" = "Required field is missing";

/* Geocoding: core: used when operation is performed over uninitialized locator */
"Locator is not initialized" = "Locator is not initialized";

/* Geocoding: core: returned when locator format is not supported */
"Unsupported locator format" = "Unsupported locator format";

/* Geocoding: core: returned when geocoding engine cannot make projection transformation */
"Unsupported projection transformation" = "Unsupported projection transformation";

/* Geocoding: core: used when given spatial reference is not supported */
"Unsupported spatial reference" = "Unsupported spatial reference";

/*Geocoding: core: used when locator being used does not support reverse geocoding */
"Reverse geocoding not supported with this locator." = "Reverse geocoding not supported with this locator.";

/* Network analyst errors */
"Cannot open network." = "Cannot open network.";
"Cannot retrieve route task parameters." = "Cannot retrieve route task parameters.";
"Insufficient number of stops." = "Insufficient number of stops.";
"Stop (%@) was not located." = "Stop (%@) was not located.";
"Stop (%@) is located on a non traversable element." = "Stop (%@) is located on a non traversable element.";
"Stop (%@) is located on a soft restricted element." = "Stop (%@) is located on a soft restricted element.";
"Point barrier (%@) was not located." = "Point barrier (%@) was not located.";
"Point barrier (%@) has invalid added cost attribute name." = "Point barrier (%@) has invalid added cost attribute name.";
"Line barrier (%@) has invalid scaled cost attribute name." = "Line barrier (%@) has invalid scaled cost attribute name.";
"Line barrier (%@) does not cover any network elements." = "Line barrier (%@) does not cover any network elements.";
"Polygon barrier (%@) has invalid scaled cost attribute name." = "Polygon barrier (%@) has invalid scaled cost attribute name.";
"Polygon barrier (%@) does not cover any network elements." = "Polygon barrier (%@) does not cover any network elements.";
"'%@' is an invalid impedance attribute." = "'%@' is an invalid impedance attribute.";
"'%@' restriction attribute is invalid." = "'%@' restriction attribute is invalid.";
"'%@' accumulate attribute is invalid." = "'%@' accumulate attribute is invalid.";
"'%@' is an invalid directions time attribute." = "'%@' is an invalid directions time attribute.";
"Directions distance attribute is invalid." = "Directions distance attribute is invalid.";
"Invalid attribute parameter attribute name (%@)." = "Invalid attribute parameter attribute name (%@).";
"Invalid attribute parameter parameter name (%@)." = "Invalid attribute parameter parameter name (%@).";
"Invalid value type for attribute (%1$@) parameter (%2$@)." = "Invalid value type for attribute (%1$@) parameter (%2$@).";
"Invalid restriction usage value for attribute (%1$@) parameter (%2$@)." = "Invalid restriction usage value for attribute (%1$@) parameter (%2$@).";
"Neutral restriction usage value for attribute (%1$@) parameter (%2$@)." = "Neutral restriction usage value for attribute (%1$@) parameter (%2$@).";
"Soft restricted element (%@) was traversed." = "Soft restricted element (%@) was traversed.";
"The network does not have a hierarchy attribute for performing hierarchical route planning." = "The network does not have a hierarchy attribute for performing hierarchical route planning.";
"No path can be found between a given pair of stops (%@)." = "No path can be found between a given pair of stops (%@).";
"The input spatial reference is undefined." = "The input spatial reference is undefined.";
"The output spatial reference is undefined." = "The output spatial reference is undefined.";
"The directions style is invalid." = "The directions style is invalid.";
"The directions language is invalid." = "The directions language is invalid.";
"Directions time and distance attributes do not match." = "Directions time and distance attributes do not match.";
"The directions road class attribute is invalid." = "The directions road class attribute is invalid.";
"Unknown condition." = "Unknown condition.";
"Invalid route task parameters." = "Invalid route task parameters.";
"Route task's solution cannot be found." = "Route task's solution cannot be found.";
"Route task was cancelled." = "Route task was cancelled.";
"Route task internal error." = "Route task internal error.";
"Route name property is not supported for local route task." = "Route name property is not supported for local route task.";
"Local route task parameters should be retrieved from route task." = "Local route task parameters should be retrieved from route task.";
"Cannot retrieve network description." = "Cannot retrieve network description.";
"Only one length attribute can be specified for impedanceAttributeName and accumulateAttributeNames." = "Only one length attribute can be specified for impedanceAttributeName and accumulateAttributeNames.";
"Only one time attribute can be specified for impedanceAttributeName and accumulateAttributeNames." = "Only one time attribute can be specified for impedanceAttributeName and accumulateAttributeNames.";
"Service not supported." = "Service not supported.";
"Specified start time occurs before January 1, 1970." = "Specified start time occurs before January 1, 1970.";
"Stop (%@) has a start time that occurs before January 1, 1970." = "Stop (%@) has a start time that occurs before January 1, 1970.";
"Stop (%@) has a local time window that starts before January 1, 1970." = "Stop (%@) has a local time window that starts before January 1, 1970.";
"Stop (%@) has a UTC time window that starts before January 1, 1970." = "Stop (%@) has a UTC time window that starts before January 1, 1970.";
"Stop (%@) has a time window end that occurs before its time window start." = "Stop (%@) has a time window end that occurs before its time window start.";

/* Unit Abbreviated strings */
"cm" = "cm";
"dd" = "dd";
"dm" = "dm";
"ft" = "ft";
"in" = "in";
"km" = "km";
"m" = "m";
"mi" = "mi";
"mm" = "mm";
"nm" = "nm";
"pt" = "pt";
"Unknown" = "Unknown";
"yd" = "yd";

/* Unit Display Strings */
"Centimeters" = "Centimeters";
"Decimal Degrees" = "Decimal Degrees";
"Decimeters" = "Decimeters";
"Feet" = "Feet";
"Inches" = "Inches";
"Kilometers" = "Kilometers";
"Meters" = "Meters";
"Miles" = "Miles";
"Millimeters" = "Millimeters";
"Nautical Miles" = "Nautical Miles";
"Points" = "Points";
"Yards" = "Yards";

/* Area Units Abbreviated Strings */
"sq. in" = "sq. in";
"sq. ft" = "sq. ft";
"sq. yd" = "sq. yd";
"ac" = "ac";
"sq. mi" = "sq. mi";
"sq. mm" = "sq. mm";
"sq. cm" = "sq. cm";
"sq. dm" = "sq. dm";
"sq. m" = "sq. m";
"ares" = "ares";
"ha" = "ha";
"sq. km" = "sq. km";

/* Area Units Display Strings */
"Square Inches" = "Square Inches";
"Square Feet" = "Square Feet";
"Square Yards" = "Square Yards";
"Acres" = "Acres";
"Square Miles" = "Square Miles";
"Square Millimeters" = "Square Millimeters";
"Square Centimeters" = "Square Centimeters";
"Square Decimeters" = "Square Decimeters";
"Square Meters" = "Square Meters";
"Ares" = "Ares";
"Hectares" = "Hectares";
"Square Kilometers" = "Square Kilometers";

/* Errors */
"Error" = "Error";
"Class not @protocol AGSCoding compliant" = "Class not @protocol AGSCoding compliant";
"Authorization required" = "Authorization required";
"Token is invalid or has expired" = "Token is invalid or has expired";
"Unknown error occurred" = "Unknown error occurred";
"Empty username/password" = "Empty username/password";
"Token URL is nil. You must set a valid token URL on the credential." = "Token URL is nil. You must set a valid token URL on the credential.";
"Unknown authentication error" = "Unknown authentication error";
"Error extracting identity" = "Error extracting identity";
"Error adding identity to the keychain" = "Error adding identity to the keychain";
"Invalid Credentials" = "Invalid Credentials";
"Bad URL." = "Bad URL.";
"The feature layer does not expose an object-id field." = "The feature layer does not expose an object-id field.";
"Both geodatabase and syncParams are required for this method." = "Both geodatabase and syncParams are required for this method.";
"Uploading deltas is not supported with this replica." = "Uploading deltas is not supported with this sync-enabled geodatabase.";
"Error creating delta geodatabase" = "Error creating delta geodatabase";
"Unable to create result image layer" = "Unable to create result image layer";
"Cache at path '%@' not found." = "Cache at path '%@' not found.";
"To add an item, you must be logged in to the portal." = "To add an item, you must be logged in to the portal.";
"To add an item, you must specify a value in the AGSPortalItemContentParameters." = "To add an item, you must specify a value in the AGSPortalItemContentParameters.";
"The portal failed to add the item." = "The portal failed to add the item.";
"To delete an item, you must be logged in to the portal." = "To delete an item, you must be logged in to the portal.";
"The portal failed to delete the item." = "The portal failed to delete the item.";
"To update an item, an itemId and logged in user are required." = "To update an item, an itemId and logged in user are required.";
"The item failed to update." = "The item failed to update.";
"The item failed to update JSON." = "The item failed to update JSON.";
"You must be logged in to a portal to add a comment." = "You must be logged in to a portal to add a comment.";
"The comment failed to be added." = "The comment failed to be added.";
"You must be logged in to a portal to fetch the current user's rating." = "You must be logged in to a portal to fetch the current user's rating.";
"You must be logged in to a portal to add a rating." = "You must be logged in to a portal to add a rating.";
"The rating failed to be added." = "The rating failed to be added.";
"To share an item, you must be logged in to the portal." = "To share an item, you must be logged in to the portal.";
"To unshare an item, you must be logged in to the portal and specify groups with which to unshare the item." = "To unshare an item, you must be logged in to the portal and specify groups with which to unshare the item.";
"Bad Request" = "Bad Request";
"Credential Required" = "AGSCredential Required";
"Job not created" = "Job not created";
"Service did not return a valid URL" = "Service did not return a valid URL";
"Service did not return a file" = "Service did not return a file";
"Service did not return a size" = "Service did not return a size";
"Job failed" = "Job failed";
"Job timed out" = "Job timed out";
"Job was cancelled" = "Job was cancelled";
"Job was deleted" = "Job was deleted";
"Feature with objectId: %d not found" = "Feature with objectId: %d not found";
"No object-id values specified for feature table query." = "No object-id values specified for feature table query.";
"Geodatbase at path '%@' not found." = "Geodatbase at path '%@' not found.";
"An error occured when creating the local Geodatabase" = "An error occured when creating the local Geodatabase";
"Operation not supported for Geodatabase Feature Service Table" = "Operation not supported for Geodatabase Feature Service Table";

/* OAuth */
"The specified clientID is invalid" = "The specified clientID is invalid";
"Log In" = "Log In";

/* Sync */
"Upload is not supported with this service." = "Upload is not supported with this service.";
"In order to call sync, a sync direction other than AGSGDBSyncDirectionNone must be specified." = "In order to call sync, a sync direction other than AGSGDBSyncDirectionNone must be specified.";

/* represents a NULL value */
"<No value>" = "<No value>";